FIOLOG/nvme0n1_220605_155841_fio.log
/dev/nvme0n1: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
...
fio-3.28
Starting 4 processes

/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=48425: Sun Jun  5 15:58:51 2022
  read: IOPS=40.7k, BW=159MiB/s (167MB/s)(1588MiB/10002msec)
    slat (nsec): min=1885, max=73730, avg=3465.50, stdev=2718.52
    clat (usec): min=866, max=3802, avg=1569.59, stdev=36.32
     lat (usec): min=895, max=3814, avg=1573.12, stdev=36.33
    clat percentiles (usec):
     |  1.00th=[ 1516],  5.00th=[ 1549], 10.00th=[ 1549], 20.00th=[ 1565],
     | 30.00th=[ 1565], 40.00th=[ 1565], 50.00th=[ 1565], 60.00th=[ 1565],
     | 70.00th=[ 1582], 80.00th=[ 1582], 90.00th=[ 1582], 95.00th=[ 1598],
     | 99.00th=[ 1631], 99.50th=[ 1647], 99.90th=[ 1778], 99.95th=[ 2057],
     | 99.99th=[ 3326]
   bw (  KiB/s): min=160760, max=163752, per=25.01%, avg=162693.89, stdev=769.37, samples=19
   iops        : min=40190, max=40938, avg=40673.47, stdev=192.34, samples=19
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=99.94%, 4=0.06%
  cpu          : usr=8.94%, sys=17.70%, ctx=191400, majf=0, minf=73
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=406642,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64
/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=48426: Sun Jun  5 15:58:51 2022
  read: IOPS=40.7k, BW=159MiB/s (167MB/s)(1589MiB/10002msec)
    slat (nsec): min=1927, max=59026, avg=3497.64, stdev=2730.12
    clat (usec): min=1029, max=3528, avg=1569.19, stdev=35.93
     lat (usec): min=1040, max=3538, avg=1572.76, stdev=35.85
    clat percentiles (usec):
     |  1.00th=[ 1516],  5.00th=[ 1549], 10.00th=[ 1549], 20.00th=[ 1565],
     | 30.00th=[ 1565], 40.00th=[ 1565], 50.00th=[ 1565], 60.00th=[ 1565],
     | 70.00th=[ 1582], 80.00th=[ 1582], 90.00th=[ 1582], 95.00th=[ 1598],
     | 99.00th=[ 1631], 99.50th=[ 1647], 99.90th=[ 1729], 99.95th=[ 2024],
     | 99.99th=[ 3523]
   bw (  KiB/s): min=161320, max=163752, per=25.01%, avg=162726.32, stdev=674.65, samples=19
   iops        : min=40330, max=40938, avg=40681.58, stdev=168.66, samples=19
  lat (msec)   : 2=99.95%, 4=0.05%
  cpu          : usr=8.39%, sys=18.28%, ctx=188791, majf=0, minf=74
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=406704,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64
/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=48427: Sun Jun  5 15:58:51 2022
  read: IOPS=40.7k, BW=159MiB/s (167MB/s)(1589MiB/10002msec)
    slat (nsec): min=1873, max=71084, avg=3443.64, stdev=2655.17
    clat (usec): min=1010, max=4209, avg=1568.98, stdev=33.63
     lat (usec): min=1015, max=4221, avg=1572.49, stdev=33.58
    clat percentiles (usec):
     |  1.00th=[ 1516],  5.00th=[ 1549], 10.00th=[ 1549], 20.00th=[ 1565],
     | 30.00th=[ 1565], 40.00th=[ 1565], 50.00th=[ 1565], 60.00th=[ 1565],
     | 70.00th=[ 1582], 80.00th=[ 1582], 90.00th=[ 1582], 95.00th=[ 1598],
     | 99.00th=[ 1614], 99.50th=[ 1647], 99.90th=[ 1696], 99.95th=[ 2212],
     | 99.99th=[ 2868]
   bw (  KiB/s): min=161360, max=163752, per=25.02%, avg=162762.53, stdev=669.32, samples=19
   iops        : min=40340, max=40938, avg=40690.63, stdev=167.33, samples=19
  lat (msec)   : 2=99.94%, 4=0.05%, 10=0.01%
  cpu          : usr=9.49%, sys=17.07%, ctx=199248, majf=0, minf=74
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=406809,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64
/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=48428: Sun Jun  5 15:58:51 2022
  read: IOPS=40.7k, BW=159MiB/s (167MB/s)(1588MiB/10001msec)
    slat (nsec): min=1919, max=189118, avg=3507.13, stdev=2744.91
    clat (usec): min=869, max=4192, avg=1569.69, stdev=39.25
     lat (usec): min=872, max=4204, avg=1573.27, stdev=39.20
    clat percentiles (usec):
     |  1.00th=[ 1516],  5.00th=[ 1549], 10.00th=[ 1549], 20.00th=[ 1565],
     | 30.00th=[ 1565], 40.00th=[ 1565], 50.00th=[ 1565], 60.00th=[ 1582],
     | 70.00th=[ 1582], 80.00th=[ 1582], 90.00th=[ 1582], 95.00th=[ 1598],
     | 99.00th=[ 1631], 99.50th=[ 1647], 99.90th=[ 1696], 99.95th=[ 1860],
     | 99.99th=[ 3982]
   bw (  KiB/s): min=161410, max=163600, per=25.00%, avg=162670.84, stdev=585.85, samples=19
   iops        : min=40352, max=40900, avg=40667.58, stdev=146.63, samples=19
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=99.96%, 4=0.03%, 10=0.01%
  cpu          : usr=9.14%, sys=17.40%, ctx=179276, majf=0, minf=74
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=406590,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=635MiB/s (666MB/s), 159MiB/s-159MiB/s (167MB/s-167MB/s), io=6354MiB (6663MB), run=10001-10002msec

Disk stats (read/write):
  nvme0n1: ios=1609531/0, merge=0/0, ticks=2517730/0, in_queue=2517731, util=99.06%