FIOLOG/nvme0n1_220606_120238_fio.log
/dev/nvme0n1: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
...
fio-3.28
Starting 4 processes

/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=997244: Mon Jun  6 12:02:49 2022
  read: IOPS=40.6k, BW=159MiB/s (166MB/s)(1587MiB/10002msec)
    slat (nsec): min=1930, max=6097.7k, avg=3518.97, stdev=9934.87
    clat (usec): min=1145, max=24945, avg=1571.51, stdev=298.43
     lat (usec): min=1159, max=24962, avg=1575.09, stdev=298.71
    clat percentiles (usec):
     |  1.00th=[ 1516],  5.00th=[ 1549], 10.00th=[ 1549], 20.00th=[ 1565],
     | 30.00th=[ 1565], 40.00th=[ 1565], 50.00th=[ 1565], 60.00th=[ 1565],
     | 70.00th=[ 1565], 80.00th=[ 1582], 90.00th=[ 1582], 95.00th=[ 1582],
     | 99.00th=[ 1614], 99.50th=[ 1631], 99.90th=[ 1680], 99.95th=[ 3097],
     | 99.99th=[24773]
   bw (  KiB/s): min=152488, max=165160, per=24.99%, avg=162506.53, stdev=2493.40, samples=19
   iops        : min=38122, max=41290, avg=40626.63, stdev=623.35, samples=19
  lat (msec)   : 2=99.94%, 4=0.03%, 10=0.02%, 20=0.01%, 50=0.01%
  cpu          : usr=8.61%, sys=17.96%, ctx=202354, majf=0, minf=75
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=406150,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64
/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=997245: Mon Jun  6 12:02:49 2022
  read: IOPS=40.6k, BW=159MiB/s (166MB/s)(1588MiB/10002msec)
    slat (nsec): min=1896, max=511484, avg=3485.24, stdev=2887.41
    clat (usec): min=1065, max=25028, avg=1570.23, stdev=285.04
     lat (usec): min=1082, max=25040, avg=1573.78, stdev=285.14
    clat percentiles (usec):
     |  1.00th=[ 1516],  5.00th=[ 1532], 10.00th=[ 1549], 20.00th=[ 1565],
     | 30.00th=[ 1565], 40.00th=[ 1565], 50.00th=[ 1565], 60.00th=[ 1565],
     | 70.00th=[ 1565], 80.00th=[ 1582], 90.00th=[ 1582], 95.00th=[ 1598],
     | 99.00th=[ 1631], 99.50th=[ 1647], 99.90th=[ 1795], 99.95th=[ 2245],
     | 99.99th=[24511]
   bw (  KiB/s): min=155640, max=164896, per=25.01%, avg=162637.47, stdev=1782.88, samples=19
   iops        : min=38910, max=41224, avg=40659.37, stdev=445.72, samples=19
  lat (msec)   : 2=99.93%, 4=0.06%, 20=0.01%, 50=0.01%
  cpu          : usr=8.93%, sys=16.95%, ctx=182379, majf=0, minf=76
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=406488,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64
/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=997246: Mon Jun  6 12:02:49 2022
  read: IOPS=40.6k, BW=159MiB/s (166MB/s)(1588MiB/10002msec)
    slat (nsec): min=1918, max=192448, avg=3506.03, stdev=2728.25
    clat (usec): min=1028, max=25045, avg=1569.97, stdev=286.05
     lat (usec): min=1050, max=25069, avg=1573.54, stdev=286.15
    clat percentiles (usec):
     |  1.00th=[ 1516],  5.00th=[ 1532], 10.00th=[ 1549], 20.00th=[ 1565],
     | 30.00th=[ 1565], 40.00th=[ 1565], 50.00th=[ 1565], 60.00th=[ 1565],
     | 70.00th=[ 1565], 80.00th=[ 1582], 90.00th=[ 1582], 95.00th=[ 1598],
     | 99.00th=[ 1631], 99.50th=[ 1647], 99.90th=[ 1680], 99.95th=[ 1844],
     | 99.99th=[24773]
   bw (  KiB/s): min=156384, max=164912, per=25.02%, avg=162670.74, stdev=1627.86, samples=19
   iops        : min=39096, max=41228, avg=40667.68, stdev=406.96, samples=19
  lat (msec)   : 2=99.96%, 4=0.02%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=9.75%, sys=16.58%, ctx=190502, majf=0, minf=77
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=406546,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64
/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=997247: Mon Jun  6 12:02:49 2022
  read: IOPS=40.7k, BW=159MiB/s (167MB/s)(1589MiB/10002msec)
    slat (nsec): min=1930, max=69630, avg=3508.33, stdev=2712.01
    clat (usec): min=1077, max=25016, avg=1569.14, stdev=286.14
     lat (usec): min=1094, max=25033, avg=1572.71, stdev=286.22
    clat percentiles (usec):
     |  1.00th=[ 1516],  5.00th=[ 1549], 10.00th=[ 1549], 20.00th=[ 1565],
     | 30.00th=[ 1565], 40.00th=[ 1565], 50.00th=[ 1565], 60.00th=[ 1565],
     | 70.00th=[ 1565], 80.00th=[ 1582], 90.00th=[ 1582], 95.00th=[ 1582],
     | 99.00th=[ 1614], 99.50th=[ 1631], 99.90th=[ 1663], 99.95th=[ 1745],
     | 99.99th=[24773]
   bw (  KiB/s): min=156920, max=165184, per=25.03%, avg=162754.95, stdev=1535.07, samples=19
   iops        : min=39230, max=41296, avg=40688.74, stdev=383.77, samples=19
  lat (msec)   : 2=99.97%, 4=0.02%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=9.58%, sys=17.10%, ctx=207228, majf=0, minf=76
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=406766,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=635MiB/s (666MB/s), 159MiB/s-159MiB/s (166MB/s-167MB/s), io=6351MiB (6660MB), run=10002-10002msec

Disk stats (read/write):
  nvme0n1: ios=1608844/0, merge=0/0, ticks=2518655/0, in_queue=2518655, util=99.05%