FIOLOG/nvme0n1_220606_122115_fio.log
/dev/nvme0n1: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
fio-3.28
Starting 1 process

/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=997817: Mon Jun  6 12:22:15 2022
  write: IOPS=5934, BW=23.2MiB/s (24.3MB/s)(1391MiB/60007msec); 0 zone resets
    slat (nsec): min=1814, max=1399.3k, avg=11041.58, stdev=9673.63
    clat (usec): min=2227, max=58121, avg=10771.17, stdev=6966.71
     lat (usec): min=2242, max=58130, avg=10782.46, stdev=6967.48
    clat percentiles (usec):
     |  1.00th=[ 6652],  5.00th=[ 6849], 10.00th=[ 6980], 20.00th=[ 7111],
     | 30.00th=[ 7308], 40.00th=[ 7504], 50.00th=[ 7701], 60.00th=[ 7898],
     | 70.00th=[ 8356], 80.00th=[10552], 90.00th=[23987], 95.00th=[27657],
     | 99.00th=[31589], 99.50th=[32900], 99.90th=[50070], 99.95th=[52167],
     | 99.99th=[56886]
   bw (  KiB/s): min= 7392, max=35752, per=99.82%, avg=23694.54, stdev=10463.32, samples=119
   iops        : min= 1848, max= 8938, avg=5923.61, stdev=2615.83, samples=119
  lat (msec)   : 4=0.01%, 10=77.54%, 20=6.65%, 50=15.71%, 100=0.10%
  cpu          : usr=4.26%, sys=8.33%, ctx=50836, majf=0, minf=11
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=0,356100,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=23.2MiB/s (24.3MB/s), 23.2MiB/s-23.2MiB/s (24.3MB/s-24.3MB/s), io=1391MiB (1459MB), run=60007-60007msec

Disk stats (read/write):
  nvme0n1: ios=48/709390, merge=0/0, ticks=67/7606823, in_queue=7606890, util=100.00%